import React from 'react';

// config
import { name, domainName } from '@config';

// components
import Shell from '@modules/shell';
import Meta from '@modules/meta';

import SingleColumns from '../../layout/single-columns';

// styles
import './style.scss';

@Shell
export default class Privacy extends React.PureComponent {
  render() {
    return (<SingleColumns>

      <div styleName="container" className="card">
      <Meta title={'隐私政策'} />

      <h1>隐私政策</h1>
      <div>

{/* 更新日期：2019 年 04 月 27 日<br /> */}
生效日期：2019 年 04 月 27 日<br />
<br />
我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。根据法律法规、国家标准等规定，制定以下《{name}隐私政策》（以下简称本政策或本隐私政策）。<br />
本政策适用于{name}网站（域名：{domainName}）、APP、小程序等产品或服务，{name}网站服务提供者（以下简称{name}或我们）。<br />
<b>{name}的产品或服务中可能含有第三方产品和/或服务的链接或信息。如果第三方产品和/或服务要求您填写相关信息，请仔细查看该第三方的隐私政策，并审慎提供个人信息。本隐私政策不适用于第三方向您收集信息的行为，{name}无法控制第三方的行为，亦不会对第三方收集和/或使用您信息的行为承担任何责任。</b><br />
请在使用我们的产品或服务前，仔细阅读并充分了解本隐私政策内容。一旦您开始使用我们的产品或服务，即表示您已充分理解并同意本政策。
<br /><br />
<h2>我们如何收集您的个人信息</h2>
<br />
{name}仅会出于本政策所述的以下目的，收集您的个人信息：<br />

1）当您注册{name}账号时，为落实网络实名制要求，向您提供用户服务，您需要提供您的手机号、密码、用户名。如果您不提供上述信息，您将无法成为{name}用户，但不影响您以游客身份使用浏览、搜索服务。<br />
2）当您注册{name}账号后，为更好地为您提供个性化服务，或者您希望其他意向合作用户或游客了解您或联系您，您可以选择提供邮箱、家乡、签名、简介、教育背景、联系方式（微信号码、QQ 号码）、个人链接、个人装备、个人标签。您不提供上述信息不影响您的使用。<br />
3）当您使用第三方账号（微信、微博、QQ）登录或绑定{name}账号时，为了记住您的身份，我们可能从第三方间接获取您在该第三方平台上的公开信息（包括昵称、头像、性别）。您可以随时解绑第三方账号。<br />
4）当您使用我们的产品或服务时，为了保障我们的产品或服务正常运行，并帮助优化您的服务体验，我们会收集您的以下信息：<br />
1、设备相关信息，例如操作系统、操作系统版本、操作系统语言、设备品牌、设备型号、设备类型、设备位置所在 IP 地址等。<br />
2、服务日志信息，例如登陆记录、搜索查询内容、网站浏览记录、点击记录、软件使用记录等。<br />

需要您注意的是，单独的设备信息、服务日志信息等无法识别特定自然人身份，除非将这类信息与其他个人身份信息结合使用，否则将不被视为个人信息。<br />
<br />
根据法律法规、国家标准规定，以下情形中，我们可能会依法收集并使用您的个人信息无需征得您的授权同意：<br />
1）与国家安全、国防安全直接相关的。<br />
2）与公共安全、公共卫生、重大公共利益直接相关的。<br />
3）与犯罪侦查、起诉、审判和判决执行等直接相关的。<br />
4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您的同意的。<br />
5）所收集的个人信息是您自行向社会公众公开的。<br />
6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。<br />
7）根据您要求签订和履行合同所必需的。<br />
8）用于维护我们所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障。<br />
9）法律法规规定的其他情形。<br />
<br /><br />
<h2>我们如何使用 Cookie 和同类技术</h2>
<br />
1）为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标志符、站点名称以及一些号码和字符。借助Cookie，网站能够记住您的用户身份、存储您的偏好。<br />
我们不会将 Cookie 用于本政策所述目的之外的其他用途。您可根据自己的偏好管理或删除 Cookie。如您的浏览器允许，您可以通过浏览器设置阻止 Cookie。但如果您这么做，可能会影响您安全访问我们的网站，且可能在每一次访问我们的网站时需要更改用户设置。<br />
2）除 Cookie 之外，我们使用网络信标（Web Beacons）来收集页面的访问量、点击量；还使用了实体标签 Etag 来做静态资源的缓存，以便加速网站的访问速度，提升您的浏览体验。<br />
<br /><br />
<h2>我们如何使用收集的信息</h2>
<br />
1）向您提供我们产品或服务。<br />
2）为向您提供更符合您个性化需求的信息展示、搜索及交易服务，我们会根据您的搜索浏览记录，展示或推送您可能感兴趣的内容。<br />
3）为改善我们的产品或服务，我们可能会对收集的信息进行去标识化或匿名化处理后，进行内部审计、数据分析和研究等。在不泄露您个人信息的前提下，可能用于商业化使用，例如对外宣传。<br />
4）当我们要将信息用于本政策未载明的其他用途时，会事先征得您的同意。<br />
5）当我们要将基于特定目的收集而来的信息用于其它目的时，会事先征得您的同意。<br />
<br /><br />
<h2>我们如何共享、转让、公开披露您的个人信息</h2>
<br />
共享<br />
我们不会向任何公司、组织和个人共享您的个人信息，但下列情况除外：<br />
1）在获得明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。<br />
2）我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。<br />
3）与关联公司共享：为便于我们及关联公司向您提供各项产品或服务、验证您的身份、识别您的账号异常等，您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。<br />
<br />
转让<br />
目前我们不会将您的个人信息转让给{name}及关联公司外的任何第三方，但下列情况除外：<br />
1）在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他第三方转让您的个人信息。<br />
2）在涉及合并、收购、资产转让等情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新征求您的同意。<br />
<br />
公开披露<br />
我们不会公开披露您的个人信息，但下列情况除外：<br />
1）获得您明确同意后或基于您的主动选择。<br />
2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。<br /><br />
根据法律法规及国家标准，以下情形中我们可能会共享、转让、公开披露您的个人信息无需征得您的同意：<br />
1）与国家安全、国防安全直接相关的。<br />
2）与公共安全、公共卫生、重大公共利益直接相关的。<br />
3）与犯罪侦查、起诉、审判和判决执行等直接相关的。<br />
4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您的同意的。<br />
5）您自行向社会公众公开的个人信息。<br />
6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。<br />
<br /><br />
<h2>我们如何保护您的个人信息</h2>
<br />
1）我们努力采用各种安全保护措施以保护您提供的个人信息，防止数据遭到未授权访问、公开披露、使用、修改、损坏或丢失。<br />
2）互联网并非绝对安全的环境，我们强烈建议您采取积极措施保证个人信息的安全，如：请使用复杂密码，定期修改账号密码，不要将账号密码等个人信息泄漏给他人。<br />
3）如不幸发生个人信息安全事件，我们将按照法律法规的要求，启动应急预案，阻止安全事件扩大，并以推送通知、公告等形式告知您。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。<br />
<br /><br />
<h2>协议修改</h2>
<br />
1）根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，小度鱼有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，小度鱼将会直接在小度鱼网站上公布修改之后的协议内容，该公布行为视为小度鱼已经通知用户修改内容。小度鱼也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。<br />
2）如果不同意小度鱼对本协议相关条款所做的修改，用户有权并应当停止使用小度鱼。如果用户继续使用小度鱼，则视为用户接受小度鱼对本协议相关条款所做的修改。

      </div>
      </div>

    </SingleColumns>)
  }

}
